In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sklearn.linear_model import LinearRegression

In [2]:
data = pd.read_csv('homeprices1.csv')

In [3]:
data.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [4]:
data.shape

(6, 4)

In [5]:
data.isnull().sum()

area        0
bedrooms    1
age         0
price       0
dtype: int64

In [12]:
data['bedrooms'] = round(data['bedrooms'].fillna(data['bedrooms'].median()))

In [13]:
data

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [14]:
X = data.iloc[:,:-1]

In [15]:
X

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [16]:
y = data.iloc[:,-1]

In [17]:
y

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [18]:
model = LinearRegression()

In [19]:
model.fit(X,y)

LinearRegression()

In [29]:
import warnings
warnings.filterwarnings('ignore')
model.predict([[4000,5,8]])

array([760663.42675457])

In [30]:
model.predict([[6000,5,10]])

array([978324.87482158])